export interface NepaliEvent {
  name: string;
  date: string;
}

export const NEPALI_EVENTS: NepaliEvent[] = [
  { name: "नयाँ वर्ष", date: "2082-01-01" },
  { name: "बुद्ध जयन्ती", date: "2082-01-31" },
  { name: "हरितालिका तीज", date: "2082-05-11" },
  { name: "घटस्थापना", date: "2082-06-14" },
  { name: "फुलपाती", date: "2082-06-20" },
  { name: "दशैं", date: "2082-06-22" },
  { name: "तिहार", date: "2082-07-01" },
  { name: "छठ पर्व", date: "2082-07-06" },
  { name: "माघे संक्रान्ति", date: "2082-10-01" },
  { name: "महाशिवरात्रि", date: "2082-10-24" },
  { name: "होली", date: "2082-11-17" },
  { name: "नयाँ वर्ष", date: "2083-01-01" },
  { name: "बुद्ध जयन्ती", date: "2083-01-18" },
  { name: "हरितालिका तीज", date: "2083-05-28" },
  { name: "दशैं", date: "2083-06-15" },
  { name: "तिहार", date: "2083-07-01" },
  { name: "माघे संक्रान्ति", date: "2083-10-01" },
  { name: "होली", date: "2083-11-29" }
];
